package main

import (
	"encoding/json"
	"fmt"
	"proWeb/internal/parser"
)

func main() {
	//multi1 := cliUtils.MultiProcessResult{
	//	Results: []cliUtils.Result{
	//		{FileName: "file1.json", Location: "storageJSON", CreatedAt: time.Now()},
	//		{FileName: "file2.json", Location: "storageJSON", CreatedAt: time.Now().Add(time.Second)},
	//		{FileName: "file3.json", Location: "storageJSON", CreatedAt: time.Now().Add(2 * time.Second)},
	//	},
	//}
	//fmt.Print(multi1.ToString())
	//jsonData := []byte(`{
	//"table": [
	//   {
	//       "coordinates": [[19, 23], [233, 64]],
	//       "text": "Товар"
	//   },
	//   {
	//       "coordinates": [[233, 23], [447, 64]],
	//       "text": "Тип операции"
	//   },
	//   {
	//       "coordinates": [[447, 23], [661, 64]],
	//       "text": "Количество, шт"
	//   },
	//   {
	//       "coordinates": [[661, 23], [800, 64]],
	//       "text": "Еще столбец"
	//   },
	//   {
	//       "coordinates": [[19, 64], [233, 105]],
	//       "text": "Печенье какое-то"
	//   },
	//   {
	//       "coordinates": [[233, 64], [447, 105]],
	//       "text": "Продажа"
	//   },
	//   {
	//       "coordinates": [[447, 64], [661, 105]],
	//       "text": "20"
	//   },
	//   {
	//       "coordinates": [[661, 64], [800, 105]],
	//       "text": "че нибудь"
	//   },
	//   {
	//       "coordinates": [[19, 105], [233, 144]],
	//       "text": "Помидоры"
	//   },
	//   {
	//       "coordinates": [[233, 105], [447, 144]],
	//       "text": "Поступление"
	//   },
	//   {
	//       "coordinates": [[447, 105], [661, 144]],
	//       "text": "228"
	//   },
	//   {
	//       "coordinates": [[661, 105], [800, 144]],
	//       "text": "еще че нибудь"
	//   }
	//]
	//}`)
	//jsonData := []byte(`{
	//"table": [
	//	{
	//		"coordinates": [
	//			[
	//				51,
	//				273
	//			],
	//			[
	//				82,
	//				390
	//			]
	//		],
	//		"text": "№"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				82,
	//				273
	//			],
	//			[
	//				166,
	//				390
	//			]
	//		],
	//		"text": "Кодтовара/\nработ, услуг"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				166,
	//				273
	//			],
	//			[
	//				383,
	//				390
	//			]
	//		],
	//		"text": "товара (описание\nвыполненных работ, оказанных\nуслуг), имущественного права"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				273
	//			],
	//			[
	//				481,
	//				319
	//			]
	//		],
	//		"text": "‘измерения"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				273
	//			],
	//			[
	//				481,
	//				319
	//			]
	//		],
	//		"text": "‘измерения"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				481,
	//				273
	//			],
	//			[
	//				546,
	//				390
	//			]
	//		],
	//		"text": "Коли-\n(объем)"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				546,
	//				273
	//			],
	//			[
	//				622,
	//				390
	//			]
	//		],
	//		"text": "Цена\n(тариф)\nза\nединицу\nизмерения"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				622,
	//				273
	//			],
	//			[
	//				719,
	//				390
	//			]
	//		],
	//		"text": "стоимость\n\"товаров (работ,\nвенных прав.\nбез налога -\nвсего"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				719,
	//				273
	//			],
	//			[
	//				783,
	//				390
	//			]
	//		],
	//		"text": "Втом\nсумма"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				783,
	//				273
	//			],
	//			[
	//				836,
	//				390
	//			]
	//		],
	//		"text": "говая\nставка"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				836,
	//				273
	//			],
	//			[
	//				921,
	//				390
	//			]
	//		],
	//		"text": "‘Сумма\nналога,\nпредьяв-\nпокупателю"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				921,
	//				273
	//			],
	//			[
	//				1017,
	//				390
	//			]
	//		],
	//		"text": "‘стоимость\n\"товаров (работ,\nправ\nналогом - всего"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				273
	//			],
	//			[
	//				1128,
	//				319
	//			]
	//		],
	//		"text": "Страна\nпроисхождения\nтовара"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				273
	//			],
	//			[
	//				1128,
	//				319
	//			]
	//		],
	//		"text": "Страна\nпроисхождения\nтовара"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1128,
	//				273
	//			],
	//			[
	//				1234,
	//				390
	//			]
	//		],
	//		"text": "таможенной\nдекларации"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				51,
	//				273
	//			],
	//			[
	//				82,
	//				390
	//			]
	//		],
	//		"text": "№"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				82,
	//				273
	//			],
	//			[
	//				166,
	//				390
	//			]
	//		],
	//		"text": "Кодтовара/\nработ, услуг"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				166,
	//				273
	//			],
	//			[
	//				383,
	//				390
	//			]
	//		],
	//		"text": "товара (описание\nвыполненных работ, оказанных\nуслуг), имущественного права"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				319
	//			],
	//			[
	//				421,
	//				390
	//			]
	//		],
	//		"text": "код"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				421,
	//				319
	//			],
	//			[
	//				481,
	//				390
	//			]
	//		],
	//		"text": "условное\nобозна-\nчение\n(нацио-"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				481,
	//				273
	//			],
	//			[
	//				546,
	//				390
	//			]
	//		],
	//		"text": "Коли-\n(объем)"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				546,
	//				273
	//			],
	//			[
	//				622,
	//				390
	//			]
	//		],
	//		"text": "Цена\n(тариф)\nза\nединицу\nизмерения"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				622,
	//				273
	//			],
	//			[
	//				719,
	//				390
	//			]
	//		],
	//		"text": "‘стоимость\n\"товаров (работ,\nвенных прав.\nбез налога -\nвсего"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				719,
	//				273
	//			],
	//			[
	//				783,
	//				390
	//			]
	//		],
	//		"text": "Втом\nсумма"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				783,
	//				273
	//			],
	//			[
	//				836,
	//				390
	//			]
	//		],
	//		"text": "говая\nставка"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				836,
	//				273
	//			],
	//			[
	//				921,
	//				390
	//			]
	//		],
	//		"text": "‘Сумма\nналога,\nпредьяв-\n‘покупателю"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				921,
	//				273
	//			],
	//			[
	//				1017,
	//				390
	//			]
	//		],
	//		"text": "‘стоимость\n\"товаров (работ,\nправ\nналогом - всего"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				319
	//			],
	//			[
	//				1052,
	//				390
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1052,
	//				319
	//			],
	//			[
	//				1128,
	//				390
	//			]
	//		],
	//		"text": "наиме-"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1128,
	//				273
	//			],
	//			[
	//				1234,
	//				390
	//			]
	//		],
	//		"text": "таможенной\nдекларации"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				51,
	//				390
	//			],
	//			[
	//				82,
	//				406
	//			]
	//		],
	//		"text": "А."
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				82,
	//				390
	//			],
	//			[
	//				166,
	//				406
	//			]
	//		],
	//		"text": "Б"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				166,
	//				390
	//			],
	//			[
	//				383,
	//				406
	//			]
	//		],
	//		"text": "т"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				390
	//			],
	//			[
	//				421,
	//				406
	//			]
	//		],
	//		"text": "2"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				421,
	//				390
	//			],
	//			[
	//				481,
	//				406
	//			]
	//		],
	//		"text": "Е"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				481,
	//				390
	//			],
	//			[
	//				546,
	//				406
	//			]
	//		],
	//		"text": "Е"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				546,
	//				390
	//			],
	//			[
	//				622,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				622,
	//				390
	//			],
	//			[
	//				719,
	//				406
	//			]
	//		],
	//		"text": "5"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				719,
	//				390
	//			],
	//			[
	//				783,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				783,
	//				390
	//			],
	//			[
	//				836,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				836,
	//				390
	//			],
	//			[
	//				921,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				921,
	//				390
	//			],
	//			[
	//				1017,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				390
	//			],
	//			[
	//				1052,
	//				406
	//			]
	//		],
	//		"text": "то"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1052,
	//				390
	//			],
	//			[
	//				1128,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1128,
	//				390
	//			],
	//			[
	//				1234,
	//				406
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				51,
	//				406
	//			],
	//			[
	//				82,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				82,
	//				406
	//			],
	//			[
	//				166,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				166,
	//				406
	//			],
	//			[
	//				383,
	//				435
	//			]
	//		],
	//		"text": "[Пирогтирольский с черникой"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				406
	//			],
	//			[
	//				421,
	//				435
	//			]
	//		],
	//		"text": "796"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				421,
	//				406
	//			],
	//			[
	//				481,
	//				435
	//			]
	//		],
	//		"text": "[шт"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				481,
	//				406
	//			],
	//			[
	//				546,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				546,
	//				406
	//			],
	//			[
	//				622,
	//				435
	//			]
	//		],
	//		"text": "14421"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				622,
	//				406
	//			],
	//			[
	//				719,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				719,
	//				406
	//			],
	//			[
	//				783,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				783,
	//				406
	//			],
	//			[
	//				836,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				836,
	//				406
	//			],
	//			[
	//				921,
	//				435
	//			]
	//		],
	//		"text": "104861"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				921,
	//				406
	//			],
	//			[
	//				1017,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				406
	//			],
	//			[
	//				1052,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1052,
	//				406
	//			],
	//			[
	//				1128,
	//				435
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1128,
	//				406
	//			],
	//			[
	//				1234,
	//				435
	//			]
	//		],
	//		"text": "Е"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				51,
	//				435
	//			],
	//			[
	//				82,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				82,
	//				435
	//			],
	//			[
	//				166,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				166,
	//				435
	//			],
	//			[
	//				383,
	//				465
	//			]
	//		],
	//		"text": "[Пирогтирольский с вишней"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				383,
	//				435
	//			],
	//			[
	//				421,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				421,
	//				435
	//			],
	//			[
	//				481,
	//				465
	//			]
	//		],
	//		"text": "шт"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				481,
	//				435
	//			],
	//			[
	//				546,
	//				465
	//			]
	//		],
	//		"text": "63.000)"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				546,
	//				435
	//			],
	//			[
	//				622,
	//				465
	//			]
	//		],
	//		"text": "14421"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				622,
	//				435
	//			],
	//			[
	//				719,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				719,
	//				435
	//			],
	//			[
	//				783,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				783,
	//				435
	//			],
	//			[
	//				836,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				836,
	//				435
	//			],
	//			[
	//				921,
	//				465
	//			]
	//		],
	//		"text": "163529"
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				921,
	//				435
	//			],
	//			[
	//				1017,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1017,
	//				435
	//			],
	//			[
	//				1052,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1052,
	//				435
	//			],
	//			[
	//				1128,
	//				465
	//			]
	//		],
	//		"text": null
	//	},
	//	{
	//		"coordinates": [
	//			[
	//				1128,
	//				435
	//			],
	//			[
	//				1234,
	//				465
	//			]
	//		],
	//		"text": null
	//	}
	//]
	//}`)
	//items, err := parser.ProcessJsonTable(jsonData)
	//if err != nil {
	//	fmt.Println(err)
	//}
	//jsonD, errs := json.MarshalIndent(items, "", "    ")
	//if errs != nil {
	//	fmt.Println(errs)
	//}
	//fmt.Println(string(jsonD))
	jsonData := []byte(`{
	"table": [
		{
			"coordinates": [
				[
					70,
					379
				],
				[
					112,
					535
				]
			],
			"text": "№"
		},
		{
			"coordinates": [
				[
					112,
					379
				],
				[
					229,
					535
				]
			],
			"text": "Код товара/\nработ, услуг"
		},
		{
			"coordinates": [
				[
					229,
					379
				],
				[
					525,
					535
				]
			],
			"text": "Наименование товара (описание\nвыполненных работ, оказанных\nуслуг), имущественного права"
		},
		{
			"coordinates": [
				[
					525,
					379
				],
				[
					660,
					438
				]
			],
			"text": "Единица\nизмерения"
		},
		{
			"coordinates": [
				[
					525,
					379
				],
				[
					660,
					438
				]
			],
			"text": "Единица\nизмерения"
		},
		{
			"coordinates": [
				[
					660,
					379
				],
				[
					749,
					535
				]
			],
			"text": "Коли-\nчество\n(объем)"
		},
		{
			"coordinates": [
				[
					749,
					379
				],
				[
					853,
					535
				]
			],
			"text": "Цена\n(тариф)\nза\nединицу\nизмерения"
		},
		{
			"coordinates": [
				[
					853,
					379
				],
				[
					985,
					535
				]
			],
			"text": "Стоимость\nтоваров (работ,\nуслуг),\nимущест-\nвенных прав\nбез налога -\nвсего"
		},
		{
			"coordinates": [
				[
					985,
					379
				],
				[
					1074,
					535
				]
			],
			"text": "Втом\nчисле\nсумма\n‘акциза"
		},
		{
			"coordinates": [
				[
					1074,
					379
				],
				[
					1146,
					535
				]
			],
			"text": "Нало-\nговая\nставка"
		},
		{
			"coordinates": [
				[
					1146,
					379
				],
				[
					1263,
					535
				]
			],
			"text": "Сумма\nналога,\nпредъяв-\nляемая\nпокупателю"
		},
		{
			"coordinates": [
				[
					1263,
					379
				],
				[
					1395,
					535
				]
			],
			"text": "Стоимость\nтоваров (работ,\nуслуг),\nимущест-\nвенных прав с\nналогом - всего"
		},
		{
			"coordinates": [
				[
					1395,
					379
				],
				[
					1547,
					438
				]
			],
			"text": "Страна\nпроисхождения\nтовара"
		},
		{
			"coordinates": [
				[
					1395,
					379
				],
				[
					1547,
					438
				]
			],
			"text": "Страна\nпроисхождения\nтовара"
		},
		{
			"coordinates": [
				[
					1547,
					379
				],
				[
					1691,
					535
				]
			],
			"text": "Номер\nтаможенной\nдекларации"
		},
		{
			"coordinates": [
				[
					70,
					379
				],
				[
					112,
					535
				]
			],
			"text": "№"
		},
		{
			"coordinates": [
				[
					112,
					379
				],
				[
					229,
					535
				]
			],
			"text": "Код товара/\nработ, услуг"
		},
		{
			"coordinates": [
				[
					229,
					379
				],
				[
					525,
					535
				]
			],
			"text": "Наименование товара (описание\nвыполненных работ, оказанных\nуслуг), имущественного права"
		},
		{
			"coordinates": [
				[
					525,
					438
				],
				[
					578,
					535
				]
			],
			"text": "код"
		},
		{
			"coordinates": [
				[
					578,
					438
				],
				[
					660,
					535
				]
			],
			"text": "условное\n‘обозна-\nчение\n(нацио-\nнальное)"
		},
		{
			"coordinates": [
				[
					660,
					379
				],
				[
					749,
					535
				]
			],
			"text": "Коли-\nчество\n(объем)"
		},
		{
			"coordinates": [
				[
					749,
					379
				],
				[
					853,
					535
				]
			],
			"text": "Цена\n(тариф)\nза\nединицу\nизмерения"
		},
		{
			"coordinates": [
				[
					853,
					379
				],
				[
					985,
					535
				]
			],
			"text": "Стоимость\nтоваров (работ,\nуслуг),\nимущест-\nвенных прав\nбез налога -\nвсего"
		},
		{
			"coordinates": [
				[
					985,
					379
				],
				[
					1074,
					535
				]
			],
			"text": "Втом\nчисле\nсумма\n‘акциза"
		},
		{
			"coordinates": [
				[
					1074,
					379
				],
				[
					1146,
					535
				]
			],
			"text": "Нало-\nговая\nставка"
		},
		{
			"coordinates": [
				[
					1146,
					379
				],
				[
					1263,
					535
				]
			],
			"text": "Сумма\nналога,\nпредъяв-\nляемая\nпокупателю"
		},
		{
			"coordinates": [
				[
					1263,
					379
				],
				[
					1395,
					535
				]
			],
			"text": "Стоимость\nтоваров (работ,\nуслуг),\nимущест-\nвенных прав с\nналогом - всего"
		},
		{
			"coordinates": [
				[
					1395,
					438
				],
				[
					1443,
					535
				]
			],
			"text": "циф-\nк"
		},
		{
			"coordinates": [
				[
					1443,
					438
				],
				[
					1547,
					535
				]
			],
			"text": "краткое\nнаиме-\nнование"
		},
		{
			"coordinates": [
				[
					1547,
					379
				],
				[
					1691,
					535
				]
			],
			"text": "Номер\nтаможенной\nдекларации"
		},
		{
			"coordinates": [
				[
					70,
					535
				],
				[
					112,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					535
				],
				[
					229,
					557
				]
			],
			"text": "Б"
		},
		{
			"coordinates": [
				[
					229,
					535
				],
				[
					525,
					557
				]
			],
			"text": "1"
		},
		{
			"coordinates": [
				[
					525,
					535
				],
				[
					578,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					578,
					535
				],
				[
					660,
					557
				]
			],
			"text": "2а"
		},
		{
			"coordinates": [
				[
					660,
					535
				],
				[
					749,
					557
				]
			],
			"text": "Е"
		},
		{
			"coordinates": [
				[
					749,
					535
				],
				[
					853,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					853,
					535
				],
				[
					985,
					557
				]
			],
			"text": "5"
		},
		{
			"coordinates": [
				[
					985,
					535
				],
				[
					1074,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1074,
					535
				],
				[
					1146,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1146,
					535
				],
				[
					1263,
					557
				]
			],
			"text": "8"
		},
		{
			"coordinates": [
				[
					1263,
					535
				],
				[
					1395,
					557
				]
			],
			"text": "Е]"
		},
		{
			"coordinates": [
				[
					1395,
					535
				],
				[
					1443,
					557
				]
			],
			"text": "10"
		},
		{
			"coordinates": [
				[
					1443,
					535
				],
				[
					1547,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					535
				],
				[
					1691,
					557
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					70,
					557
				],
				[
					112,
					597
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					557
				],
				[
					229,
					597
				]
			],
			"text": "00-00000035"
		},
		{
			"coordinates": [
				[
					229,
					557
				],
				[
					525,
					597
				]
			],
			"text": "тирольский с вишней"
		},
		{
			"coordinates": [
				[
					525,
					557
				],
				[
					578,
					597
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					557
				],
				[
					660,
					597
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					557
				],
				[
					749,
					597
				]
			],
			"text": "355,000"
		},
		{
			"coordinates": [
				[
					749,
					557
				],
				[
					853,
					597
				]
			],
			"text": "152,54"
		},
		{
			"coordinates": [
				[
					853,
					557
				],
				[
					985,
					597
				]
			],
			"text": "54 152,54"
		},
		{
			"coordinates": [
				[
					985,
					557
				],
				[
					1074,
					597
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1074,
					557
				],
				[
					1146,
					597
				]
			],
			"text": "18%"
		},
		{
			"coordinates": [
				[
					1146,
					557
				],
				[
					1263,
					597
				]
			],
			"text": "9747,46"
		},
		{
			"coordinates": [
				[
					1263,
					557
				],
				[
					1395,
					597
				]
			],
			"text": "63 900,00]—"
		},
		{
			"coordinates": [
				[
					1395,
					557
				],
				[
					1443,
					597
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					557
				],
				[
					1547,
					597
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					557
				],
				[
					1691,
					597
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					70,
					597
				],
				[
					112,
					638
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					597
				],
				[
					229,
					638
				]
			],
			"text": "00-00000032"
		},
		{
			"coordinates": [
				[
					229,
					597
				],
				[
					525,
					638
				]
			],
			"text": "[Печенье"
		},
		{
			"coordinates": [
				[
					525,
					597
				],
				[
					578,
					638
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					597
				],
				[
					660,
					638
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					597
				],
				[
					749,
					638
				]
			],
			"text": "364,000"
		},
		{
			"coordinates": [
				[
					749,
					597
				],
				[
					853,
					638
				]
			],
			"text": "12742"
		},
		{
			"coordinates": [
				[
					853,
					597
				],
				[
					985,
					638
				]
			],
			"text": "46 271,19"
		},
		{
			"coordinates": [
				[
					985,
					597
				],
				[
					1074,
					638
				]
			],
			"text": "|без"
		},
		{
			"coordinates": [
				[
					1074,
					597
				],
				[
					1146,
					638
				]
			],
			"text": "8%"
		},
		{
			"coordinates": [
				[
					1146,
					597
				],
				[
					1263,
					638
				]
			],
			"text": "8328,81"
		},
		{
			"coordinates": [
				[
					1263,
					597
				],
				[
					1395,
					638
				]
			],
			"text": "54"
		},
		{
			"coordinates": [
				[
					1395,
					597
				],
				[
					1443,
					638
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					597
				],
				[
					1547,
					638
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					597
				],
				[
					1691,
					638
				]
			],
			"text": "|[-"
		},
		{
			"coordinates": [
				[
					70,
					638
				],
				[
					112,
					678
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					638
				],
				[
					229,
					678
				]
			],
			"text": "00-00000039"
		},
		{
			"coordinates": [
				[
					229,
					638
				],
				[
					525,
					678
				]
			],
			"text": "\"Венские\" с шоколадом"
		},
		{
			"coordinates": [
				[
					525,
					638
				],
				[
					578,
					678
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					638
				],
				[
					660,
					678
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					638
				],
				[
					749,
					678
				]
			],
			"text": "259,000"
		},
		{
			"coordinates": [
				[
					749,
					638
				],
				[
					853,
					678
				]
			],
			"text": "50,85"
		},
		{
			"coordinates": [
				[
					853,
					638
				],
				[
					985,
					678
				]
			],
			"text": "13 169,49"
		},
		{
			"coordinates": [
				[
					985,
					638
				],
				[
					1074,
					678
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1074,
					638
				],
				[
					1146,
					678
				]
			],
			"text": "18%"
		},
		{
			"coordinates": [
				[
					1146,
					638
				],
				[
					1263,
					678
				]
			],
			"text": "2370,51"
		},
		{
			"coordinates": [
				[
					1263,
					638
				],
				[
					1395,
					678
				]
			],
			"text": "15"
		},
		{
			"coordinates": [
				[
					1395,
					638
				],
				[
					1443,
					678
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					638
				],
				[
					1547,
					678
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					638
				],
				[
					1691,
					678
				]
			],
			"text": "|[-"
		},
		{
			"coordinates": [
				[
					70,
					678
				],
				[
					112,
					719
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					678
				],
				[
					229,
					719
				]
			],
			"text": "00-00000037"
		},
		{
			"coordinates": [
				[
					229,
					678
				],
				[
					525,
					719
				]
			],
			"text": "\"Юбилейное\""
		},
		{
			"coordinates": [
				[
					525,
					678
				],
				[
					578,
					719
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					678
				],
				[
					660,
					719
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					678
				],
				[
					749,
					719
				]
			],
			"text": "117,000"
		},
		{
			"coordinates": [
				[
					749,
					678
				],
				[
					853,
					719
				]
			],
			"text": "84.75"
		},
		{
			"coordinates": [
				[
					853,
					678
				],
				[
					985,
					719
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					985,
					678
				],
				[
					1074,
					719
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1074,
					678
				],
				[
					1146,
					719
				]
			],
			"text": "18%"
		},
		{
			"coordinates": [
				[
					1146,
					678
				],
				[
					1263,
					719
				]
			],
			"text": "1784.75"
		},
		{
			"coordinates": [
				[
					1263,
					678
				],
				[
					1395,
					719
				]
			],
			"text": "11"
		},
		{
			"coordinates": [
				[
					1395,
					678
				],
				[
					1443,
					719
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					678
				],
				[
					1547,
					719
				]
			],
			"text": "КОТ\n|Д'ИВУАР."
		},
		{
			"coordinates": [
				[
					1547,
					678
				],
				[
					1691,
					719
				]
			],
			"text": "10001000/010216/\n0005461"
		},
		{
			"coordinates": [
				[
					70,
					719
				],
				[
					112,
					759
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					719
				],
				[
					229,
					759
				]
			],
			"text": "00-00000033"
		},
		{
			"coordinates": [
				[
					229,
					719
				],
				[
					525,
					759
				]
			],
			"text": "[Пирог тирольский с черникой"
		},
		{
			"coordinates": [
				[
					525,
					719
				],
				[
					578,
					759
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					719
				],
				[
					660,
					759
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					719
				],
				[
					749,
					759
				]
			],
			"text": "144,000"
		},
		{
			"coordinates": [
				[
					749,
					719
				],
				[
					853,
					759
				]
			],
			"text": "152,54"
		},
		{
			"coordinates": [
				[
					853,
					719
				],
				[
					985,
					759
				]
			],
			"text": "21 966,10"
		},
		{
			"coordinates": [
				[
					985,
					719
				],
				[
					1074,
					759
				]
			],
			"text": "без\nакциза"
		},
		{
			"coordinates": [
				[
					1074,
					719
				],
				[
					1146,
					759
				]
			],
			"text": "8%"
		},
		{
			"coordinates": [
				[
					1146,
					719
				],
				[
					1263,
					759
				]
			],
			"text": "3953,90"
		},
		{
			"coordinates": [
				[
					1263,
					719
				],
				[
					1395,
					759
				]
			],
			"text": "25"
		},
		{
			"coordinates": [
				[
					1395,
					719
				],
				[
					1443,
					759
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					719
				],
				[
					1547,
					759
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					719
				],
				[
					1691,
					759
				]
			],
			"text": "|[-"
		},
		{
			"coordinates": [
				[
					70,
					759
				],
				[
					112,
					800
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					759
				],
				[
					229,
					800
				]
			],
			"text": "00-00000040"
		},
		{
			"coordinates": [
				[
					229,
					759
				],
				[
					525,
					800
				]
			],
			"text": "Вафли со сгущенным"
		},
		{
			"coordinates": [
				[
					525,
					759
				],
				[
					578,
					800
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					759
				],
				[
					660,
					800
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					759
				],
				[
					749,
					800
				]
			],
			"text": "197,000"
		},
		{
			"coordinates": [
				[
					749,
					759
				],
				[
					853,
					800
				]
			],
			"text": "6780"
		},
		{
			"coordinates": [
				[
					853,
					759
				],
				[
					985,
					800
				]
			],
			"text": "13 355,93"
		},
		{
			"coordinates": [
				[
					985,
					759
				],
				[
					1074,
					800
				]
			],
			"text": "акциза"
		},
		{
			"coordinates": [
				[
					1074,
					759
				],
				[
					1146,
					800
				]
			],
			"text": "18%"
		},
		{
			"coordinates": [
				[
					1146,
					759
				],
				[
					1263,
					800
				]
			],
			"text": "2404,07"
		},
		{
			"coordinates": [
				[
					1263,
					759
				],
				[
					1395,
					800
				]
			],
			"text": "15"
		},
		{
			"coordinates": [
				[
					1395,
					759
				],
				[
					1443,
					800
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					759
				],
				[
					1547,
					800
				]
			],
			"text": "КОТ\n|Д'ИВУАР."
		},
		{
			"coordinates": [
				[
					1547,
					759
				],
				[
					1691,
					800
				]
			],
			"text": "10001000/010216/\n0005897"
		},
		{
			"coordinates": [
				[
					70,
					800
				],
				[
					112,
					840
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					800
				],
				[
					229,
					840
				]
			],
			"text": "00-00000041"
		},
		{
			"coordinates": [
				[
					229,
					800
				],
				[
					525,
					840
				]
			],
			"text": "с клубничным"
		},
		{
			"coordinates": [
				[
					525,
					800
				],
				[
					578,
					840
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					800
				],
				[
					660,
					840
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					800
				],
				[
					749,
					840
				]
			],
			"text": "425,000"
		},
		{
			"coordinates": [
				[
					749,
					800
				],
				[
					853,
					840
				]
			],
			"text": "93,22"
		},
		{
			"coordinates": [
				[
					853,
					800
				],
				[
					985,
					840
				]
			],
			"text": "39 618,64"
		},
		{
			"coordinates": [
				[
					985,
					800
				],
				[
					1074,
					840
				]
			],
			"text": "без\nакциза"
		},
		{
			"coordinates": [
				[
					1074,
					800
				],
				[
					1146,
					840
				]
			],
			"text": "18%"
		},
		{
			"coordinates": [
				[
					1146,
					800
				],
				[
					1263,
					840
				]
			],
			"text": "7131,36"
		},
		{
			"coordinates": [
				[
					1263,
					800
				],
				[
					1395,
					840
				]
			],
			"text": "46"
		},
		{
			"coordinates": [
				[
					1395,
					800
				],
				[
					1443,
					840
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					800
				],
				[
					1547,
					840
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					800
				],
				[
					1691,
					840
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					70,
					840
				],
				[
					112,
					881
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					840
				],
				[
					229,
					881
				]
			],
			"text": "00-00000038"
		},
		{
			"coordinates": [
				[
					229,
					840
				],
				[
					525,
					881
				]
			],
			"text": "\"Батончик\""
		},
		{
			"coordinates": [
				[
					525,
					840
				],
				[
					578,
					881
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					840
				],
				[
					660,
					881
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					840
				],
				[
					749,
					881
				]
			],
			"text": "327,000"
		},
		{
			"coordinates": [
				[
					749,
					840
				],
				[
					853,
					881
				]
			],
			"text": "101,69"
		},
		{
			"coordinates": [
				[
					853,
					840
				],
				[
					985,
					881
				]
			],
			"text": "33 254,24"
		},
		{
			"coordinates": [
				[
					985,
					840
				],
				[
					1074,
					881
				]
			],
			"text": "без"
		},
		{
			"coordinates": [
				[
					1074,
					840
				],
				[
					1146,
					881
				]
			],
			"text": "8%"
		},
		{
			"coordinates": [
				[
					1146,
					840
				],
				[
					1263,
					881
				]
			],
			"text": "5985,76"
		},
		{
			"coordinates": [
				[
					1263,
					840
				],
				[
					1395,
					881
				]
			],
			"text": "39"
		},
		{
			"coordinates": [
				[
					1395,
					840
				],
				[
					1443,
					881
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1443,
					840
				],
				[
					1547,
					881
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					1547,
					840
				],
				[
					1691,
					881
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					70,
					881
				],
				[
					112,
					921
				]
			],
			"text": null
		},
		{
			"coordinates": [
				[
					112,
					881
				],
				[
					229,
					921
				]
			],
			"text": "00-00000034"
		},
		{
			"coordinates": [
				[
					229,
					881
				],
				[
					525,
					921
				]
			],
			"text": "классические"
		},
		{
			"coordinates": [
				[
					525,
					881
				],
				[
					578,
					921
				]
			],
			"text": "796"
		},
		{
			"coordinates": [
				[
					578,
					881
				],
				[
					660,
					921
				]
			],
			"text": "шт"
		},
		{
			"coordinates": [
				[
					660,
					881
				],
				[
					749,
					921
				]
			],
			"text": "228,000"
		},
		{
			"coordinates": [
				[
					749,
					881
				],
				[
					853,
					921
				]
			],
			"text": "266,95"
		},
		{
			"coordinates": [
				[
					853,
					881
				],
				[
					985,
					921
				]
			],
			"text": "60 864,41"
		},
		{
			"coordinates": [
				[
					985,
					881
				],
				[
					1074,
					921
				]
			],
			"text": "[акциза"
		},
		{
			"coordinates": [
				[
					1074,
					881
				],
				[
					1146,
					921
				]
			],
			"text": "8%"
		},
		{
			"coordinates": [
				[
					1146,
					881
				],
				[
					1263,
					921
				]
			],
			"text": "10 955,59"
		},
		{
			"coordinates": [
				[
					1263,
					881
				],
				[
					1395,
					921
				]
			],
			"text": "71 820,00]"
		},
		{
			"coordinates": [
				[
					1395,
					881
				],
				[
					1443,
					921
				]
			],
			"text": "112"
		},
		{
			"coordinates": [
				[
					1443,
					881
				],
				[
					1547,
					921
				]
			],
			"text": "БЕЛАРУСЬ"
		},
		{
			"coordinates": [
				[
					1547,
					881
				],
				[
					1691,
					921
				]
			],
			"text": "10001000/010216/\n0005461"
		}
	]
	}`)
	table, _ := parser.ParseTable(jsonData)
	items := parser.GetAllTitles(table)
	jsonD, errs := json.MarshalIndent(items, "", "    ")
	if errs != nil {
		fmt.Println(errs)
	}
	fmt.Println(string(jsonD))
}
